In [25]:
import pandas as pd
data = [['Dan', 30, 40000], ['Jhon', 40 , 50000],
       ['Hellen', 35, 60000], ['Mary', 29, 58000]]
df = pd.DataFrame(data=data, columns=["Name", "Age", "Salary"])
df

     Name  Age  Salary
0     Dan   30   40000
1    Jhon   40   50000
2  Hellen   35   60000
3    Mary   29   58000

In [2]:
df["Salary"] > 50000

0    False
1    False
2     True
3     True
Name: Salary, dtype: bool

In [3]:
df[df["Salary"] > 50000]

     Name  Age  Salary
2  Hellen   35   60000
3    Mary   29   58000

In [5]:
df[df.loc[:, "Salary"] > 50000]

     Name  Age  Salary
2  Hellen   35   60000
3    Mary   29   58000

In [6]:
df[df.loc[:, "Salary"] > 50000]['Name']

2    Hellen
3      Mary
Name: Name, dtype: object

In [8]:
df[df.loc[:, "Salary"] > 50000][['Name', 'Age']]

     Name  Age
2  Hellen   35
3    Mary   29

In [9]:
df[df.loc[:, 'Age']==29]

   Name  Age  Salary
3  Mary   29   58000

In [10]:
df[~ (df.loc[: , "Salary"]< 50000)] # press Alt + 126 for the tilda character
# tilda is for negation

     Name  Age  Salary
1    Jhon   40   50000
2  Hellen   35   60000
3    Mary   29   58000

In [11]:
df["Salary"].max()

60000

In [12]:
df.Salary.max()

60000

In [14]:
r = df["Salary"].idxmax()
r

2

In [15]:
df.iloc[r]

Name      Hellen
Age           35
Salary     60000
Name: 2, dtype: object

In [16]:
df.set_index('Salary', inplace=True)
df

          Name  Age
Salary
40000      Dan   30
50000     Jhon   40
60000   Hellen   35
58000     Mary   29

In [24]:
df.reset_index(inplace=True)
df

   level_0  index  Salary    Name  Age
0        0      0   40000     Dan   30
1        1      1   50000    Jhon   40
2        2      2   60000  Hellen   35
3        3      3   58000    Mary   29

In [26]:
df[(df['Salary']>50000) & (df['Age'] > 30)] # "and" not work in this case

     Name  Age  Salary
2  Hellen   35   60000

In [27]:
df[(df['Salary']>50000) | (df['Age'] > 30)] # "or2 not work in this case

     Name  Age  Salary
1    Jhon   40   50000
2  Hellen   35   60000
3    Mary   29   58000

In [28]:
df[df['Salary'].between(45000, 59000)]

   Name  Age  Salary
1  Jhon   40   50000
3  Mary   29   58000